## Generate predictions on the test data set

In [1]:
import pandas as pd
import numpy as np
from sklearn import preprocessing
import itertools
import matplotlib.pyplot as plt
from sklearn.metrics import confusion_matrix, precision_recall_fscore_support, accuracy_score, cohen_kappa_score
%matplotlib inline

class_names = ["A", "B", "None"]

In [2]:
def plot_confusion_matrix(cm, classes,
                          normalize=False,
                          title='Confusion matrix',
                          cmap=plt.cm.Blues):
    """
    This function prints and plots the confusion matrix.
    Normalization can be applied by setting `normalize=True`.
    """
    if normalize:
        cm = cm.astype('float') / cm.sum(axis=1)[:, np.newaxis]
    #     print("Normalized confusion matrix")
    # else:
    #     print('Confusion matrix, without normalization')

    # print(cm)

    plt.imshow(cm, interpolation='nearest', cmap=cmap)
    plt.title(title)
    plt.colorbar()
    tick_marks = np.arange(len(classes))
    plt.xticks(tick_marks, classes, rotation=45)
    plt.yticks(tick_marks, classes)

    fmt = '.2f' if normalize else 'd'
    thresh = cm.max() / 2.
    for i, j in itertools.product(range(cm.shape[0]), range(cm.shape[1])):
        plt.text(j, i, format(cm[i, j], fmt),
                 horizontalalignment="center",
                 color="white" if cm[i, j] > thresh else "black")

    plt.tight_layout()
    plt.ylabel('True label')
    plt.xlabel('Predicted label')

### Load Scikit Learn Model

In [3]:
import pickle

model = pickle.load(open("models/adaboost_kappa_0_2836.pickle.dat", "rb"))

C:\Users\issuser\Anaconda3\lib\site-packages\sklearn\base.py:306: UserWarning: Trying to unpickle estimator DecisionTreeClassifier from version 0.21.2 when using version 0.21.3. This might lead to breaking code or invalid results. Use at your own risk.
  UserWarning)
C:\Users\issuser\Anaconda3\lib\site-packages\sklearn\base.py:306: UserWarning: Trying to unpickle estimator AdaBoostClassifier from version 0.21.2 when using version 0.21.3. This might lead to breaking code or invalid results. Use at your own risk.
  UserWarning)

### Load Keras Model

In [4]:
# the model must be in the models folder
# model_to_use = "model-004-0.82.h5"
# model_to_use = "NN_kappa_0_2897.h5"

# from keras.models import load_model
# model = load_model('models/'+model_to_use)

In [5]:
df = pd.read_csv("original_data/custdatabase.csv")
df_copy = pd.read_csv("original_data/custdatabase.csv")
print('Test dataset shape {0}, {1}'.format(df.shape[0], df.shape[1]))

Test dataset shape 4000, 10

In [6]:
# strip the spaces in the header, if present
df = df.rename(columns=lambda x: x.strip())
df.columns.values

array(['index', 'sex', 'mstatus', 'age', 'children', 'occupation',
       'education', 'income', 'avbal', 'avtrans'], dtype=object)

In [7]:
categorical_features = ["sex", "mstatus", "occupation", "education", "children"]
df[categorical_features].head()
df["children"] = df["children"].astype(str)
label_encoders = {}
label_mappings = {}
for categorical_feature in categorical_features:
    label_encoders[categorical_feature] = preprocessing.LabelEncoder()
    df[categorical_feature + "Num"] = label_encoders[categorical_feature].fit_transform(df[categorical_feature])
    label_mappings[categorical_feature] = label_encoders[categorical_feature].classes_

label_encoders = {}
label_mappings = {}
for categorical_feature in categorical_features:
    label_encoders[categorical_feature] = preprocessing.LabelEncoder()
    df[categorical_feature + "Num"] = label_encoders[categorical_feature].fit_transform(df[categorical_feature])
    label_mappings[categorical_feature] = label_encoders[categorical_feature].classes_

for categorical_feature in categorical_features:
    for class_value in label_mappings[categorical_feature]:
        df[categorical_feature + "_" + (class_value)] = df[categorical_feature] == np.array([(class_value)] * df.shape[0])
        df[categorical_feature + "_" + (class_value)] = df[categorical_feature + "_" + (class_value)].astype(int)

# drop the categorical values
df = df.drop(categorical_features, axis=1)

df.head()

,index,age,income,avbal,avtrans,sexNum,mstatusNum,occupationNum,educationNum,childrenNum,...,occupation_retired,education_postgrad,education_professional,education_secondary,education_tertiary,children_0,children_1,children_2,children_3,children_4
0,1001,44.27,10245.73,53183.04,4069.67,1,0,5,0,2,...,0,1,0,0,0,0,0,1,0,0
1,1002,61.90,1942.57,18100.78,1522.42,1,1,5,2,1,...,0,0,0,1,0,0,1,0,0,0
2,1003,37.30,9896.16,24496.82,2723.35,1,0,0,3,1,...,0,0,0,0,1,0,1,0,0,0
3,1004,25.02,10136.44,26690.01,4143.04,0,0,5,0,1,...,0,1,0,0,0,0,1,0,0,0
4,1005,48.37,2521.11,13439.81,240.26,0,0,4,2,2,...,0,0,0,1,0,0,0,1,0,0

### Remove the "Num" columns only if required

In [8]:
# remove num columns for Neural networks
isNeuralNetwork = False

In [9]:
if isNeuralNetwork:
    num_columns = ["sexNum", "mstatusNum", "occupationNum", "educationNum", "childrenNum"]
    df = df.drop(num_columns, axis=1)
else:
    print("Not dropping the num columns")
df.head()

Not dropping the num columns

,index,age,income,avbal,avtrans,sexNum,mstatusNum,occupationNum,educationNum,childrenNum,...,occupation_retired,education_postgrad,education_professional,education_secondary,education_tertiary,children_0,children_1,children_2,children_3,children_4
0,1001,44.27,10245.73,53183.04,4069.67,1,0,5,0,2,...,0,1,0,0,0,0,0,1,0,0
1,1002,61.90,1942.57,18100.78,1522.42,1,1,5,2,1,...,0,0,0,1,0,0,1,0,0,0
2,1003,37.30,9896.16,24496.82,2723.35,1,0,0,3,1,...,0,0,0,0,1,0,1,0,0,0
3,1004,25.02,10136.44,26690.01,4143.04,0,0,5,0,1,...,0,1,0,0,0,0,1,0,0,0
4,1005,48.37,2521.11,13439.81,240.26,0,0,4,2,2,...,0,0,0,1,0,0,0,1,0,0

## Get the normalizers based on the train data

In [10]:
train_df = pd.read_csv("working_data/trial_promo_training.csv")
features_to_scale = ["age", "income", "avbal", "avtrans"]
min_max_scaler = preprocessing.MinMaxScaler()

# fit on the train data
train_df[features_to_scale] = min_max_scaler.fit(train_df[features_to_scale])

# transform the test data
df[features_to_scale] = min_max_scaler.transform(df[features_to_scale])
df.head()

,index,age,income,avbal,avtrans,sexNum,mstatusNum,occupationNum,educationNum,childrenNum,...,occupation_retired,education_postgrad,education_professional,education_secondary,education_tertiary,children_0,children_1,children_2,children_3,children_4
0,1001,0.364876,0.510499,0.675107,0.497236,1,0,5,0,2,...,0,1,0,0,0,0,0,1,0,0
1,1002,0.610214,0.081311,0.222841,0.182472,1,1,5,2,1,...,0,0,0,1,0,0,1,0,0,0
2,1003,0.267882,0.492430,0.305296,0.330871,1,0,0,3,1,...,0,0,0,0,1,0,1,0,0,0
3,1004,0.096994,0.504850,0.333570,0.506303,0,0,5,0,1,...,0,1,0,0,0,0,1,0,0,0
4,1005,0.421932,0.111215,0.162754,0.024034,0,0,4,2,2,...,0,0,0,1,0,0,0,1,0,0

In [11]:
customer_ids = df["index"]
df = df.drop("index", axis=1)
df.head()

,age,income,avbal,avtrans,sexNum,mstatusNum,occupationNum,educationNum,childrenNum,sex_F,...,occupation_retired,education_postgrad,education_professional,education_secondary,education_tertiary,children_0,children_1,children_2,children_3,children_4
0,0.364876,0.510499,0.675107,0.497236,1,0,5,0,2,0,...,0,1,0,0,0,0,0,1,0,0
1,0.610214,0.081311,0.222841,0.182472,1,1,5,2,1,0,...,0,0,0,1,0,0,1,0,0,0
2,0.267882,0.492430,0.305296,0.330871,1,0,0,3,1,0,...,0,0,0,0,1,0,1,0,0,0
3,0.096994,0.504850,0.333570,0.506303,0,0,5,0,1,1,...,0,1,0,0,0,0,1,0,0,0
4,0.421932,0.111215,0.162754,0.024034,0,0,4,2,2,1,...,0,0,0,1,0,0,0,1,0,0

In [12]:
df.columns

Index(['age', 'income', 'avbal', 'avtrans', 'sexNum', 'mstatusNum',
       'occupationNum', 'educationNum', 'childrenNum', 'sex_F', 'sex_M',
       'mstatus_divorced', 'mstatus_married', 'mstatus_single',
       'mstatus_widowed', 'occupation_IT', 'occupation_construct',
       'occupation_education', 'occupation_finance', 'occupation_government',
       'occupation_legal', 'occupation_manuf', 'occupation_medicine',
       'occupation_retired', 'education_postgrad', 'education_professional',
       'education_secondary', 'education_tertiary', 'children_0', 'children_1',
       'children_2', 'children_3', 'children_4'],
      dtype='object')

## Perform the predictions using the model

In [13]:
if isNeuralNetwork:
    X_test = df
    X_test.head(5)
else:
    feature_columns = ["age", "income", "avbal", "avtrans", "sexNum", "mstatusNum", "occupationNum", "educationNum", "childrenNum"]
    X_test = df.loc[:, feature_columns]
    X_test.head(5)

In [14]:
if isNeuralNetwork:
    model_predictions = model.predict(X_test)
    model_predictions = np.argmax(model_predictions, axis=1)
else:
    model_predictions = model.predict(X_test)
    
df_copy["status"] = model_predictions
df_copy["status"] = df_copy["status"].astype(int)
df_copy["status"].head()

0    2
1    0
2    2
3    1
4    2
Name: status, dtype: int32

In [15]:
df_copy["status"] = df_copy["status"].replace(0, "A").replace(1, "B").replace(2, "None")
df_copy.head(50)

,index,sex,mstatus,age,children,occupation,education,income,avbal,avtrans,status
0,1001,M,divorced,44.27,2,legal,postgrad,10245.73,53183.04,4069.67,None
1,1002,M,married,61.90,1,legal,secondary,1942.57,18100.78,1522.42,A
2,1003,M,divorced,37.30,1,IT,tertiary,9896.16,24496.82,2723.35,None
3,1004,F,divorced,25.02,1,legal,postgrad,10136.44,26690.01,4143.04,B
4,1005,F,divorced,48.37,2,government,secondary,2521.11,13439.81,240.26,None
5,1006,M,widowed,49.19,3,manuf,secondary,610.07,8027.86,817.78,None
6,1007,F,married,66.07,2,retired,tertiary,3153.71,13146.35,1716.52,A
7,1008,F,divorced,65.81,1,retired,postgrad,3656.70,6914.14,2149.30,None
8,1009,F,married,44.65,2,IT,tertiary,5825.72,22830.97,1196.25,A
9,1010,F,single,23.16,0,IT,tertiary,2737.99,13859.05,776.99,B
10,1011,M,widowed,52.58,1,manuf,secondary,3257.43,20059.75,729.58,None
11,1012,F,married,39.61,0,legal,secondary,4836.80,19294.20,832.48,A
12,1013,F,single,39.68,0,finance,tertiary,8361.30,20973.31,2059.34,None
13,1014,M,single,29.73,0,finance,tertiary,3642.03,24124.66,1797.93,None
14,1015,F,divorced,64.56,2,construct,postgrad,3642.03,24124.66,1797.93,None
15,1016,M,married,56.16,2,manuf,tertiary,3782.55,34553.75,1520.36,A
16,1017,F,single,40.91,0,education,tertiary,3431.36,13256.18,1246.05,None
17,1018,F,married,39.11,1,legal,postgrad,12563.13,29157.55,5941.43,A
18,1019,F,widowed,65.68,0,retired,tertiary,4388.41,14914.65,501.97,None
19,1020,M,divorced,49.48,2,government,tertiary,6364.90,14776.51,1717.65,None
20,1021,F,married,67.08,2,retired,secondary,910.38,13777.26,317.43,A
21,1022,M,divorced,26.22,2,IT,secondary,1858.62,24750.02,1137.89,B
22,1023,F,single,19.46,0,manuf,postgrad,4724.51,35985.78,1134.38,B
23,1024,M,single,23.04,0,finance,tertiary,8302.74,22384.38,684.36,B
24,1025,F,single,18.08,0,IT,professional,9217.58,43022.45,4855.55,B
25,1026,M,divorced,46.60,0,finance,tertiary,3527.12,13777.86,1441.71,None
26,1027,M,married,59.33,2,legal,postgrad,10497.62,44744.61,2768.20,A
27,1028,M,single,21.74,0,government,tertiary,4081.58,28519.68,858.28,B
28,1029,F,widowed,62.36,2,government,postgrad,2690.97,41035.50,2752.43,None
29,1030,F,divorced,42.43,2,manuf,professional,15965.52,29414.23,1625.25,None
30,1031,M,married,45.44,1,government,tertiary,3970.17,16069.47,526.99,A
31,1032,F,married,27.21,1,education,secondary,1763.86,7318.26,440.05,A
32,1033,F,divorced,60.44,1,manuf,tertiary,3496.20,7700.52,1519.41,None
33,1034,M,divorced,49.66,3,construct,tertiary,3496.20,7700.52,1519.41,None
34,1035,F,single,22.06,0,government,tertiary,6749.49,31665.16,1562.20,B
35,1036,M,divorced,51.91,2,government,tertiary,3821.27,11009.15,1731.29,None
36,1037,M,married,24.33,2,government,tertiary,3140.78,14436.48,727.73,A
37,1038,F,single,25.84,0,construct,secondary,3140.78,14436.48,727.73,B
38,1039,M,married,61.52,0,finance,professional,11608.79,27529.23,2803.96,A
39,1040,F,widowed,87.86,1,retired,tertiary,4775.18,16048.79,1095.75,None
40,1041,F,single,47.20,0,medicine,tertiary,2511.49,41205.04,3674.55,None
41,1042,F,married,63.95,1,construct,tertiary,2511.49,41205.04,3674.55,A
42,1043,M,married,41.00,2,manuf,tertiary,5882.28,33236.27,2404.76,A
43,1044,M,widowed,53.53,1,finance,tertiary,3696.67,31597.47,2030.93,None
44,1045,F,married,28.62,2,legal,postgrad,10001.84,40463.27,4705.42,A
45,1046,M,married,27.25,0,finance,postgrad,10363.69,30011.80,4792.02,A
46,1047,F,single,25.70,0,finance,secondary,2300.29,7507.26,1306.82,None
47,1048,M,divorced,41.09,3,manuf,postgrad,10173.30,29034.73,2359.88,None
48,1049,F,single,35.25,0,medicine,tertiary,6787.24,31607.80,1482.03,None
49,1050,F,divorced,44.15,2,government,tertiary,2448.45,14296.98,1489.78,None

### Merge status predicted by classifier and investment score generated by Fuzzy Rule

In [16]:
df_investment_score = pd.read_csv("results/predicted_scores.csv")
df_investment_score = df_investment_score.loc[:,["index", "score"]]
df_investment_score.head(5)

   index  score
0   1001   5.07
1   1002   3.80
2   1003   4.38
3   1004   4.55
4   1005   3.09

In [17]:
df_merged = df_copy.set_index('index').join(df_investment_score.set_index('index'))
df_merged.head(5)

,sex,mstatus,age,children,occupation,education,income,avbal,avtrans,status,score
index,,,,,,,,,,,
1001,M,divorced,44.27,2,legal,postgrad,10245.73,53183.04,4069.67,None,5.07
1002,M,married,61.90,1,legal,secondary,1942.57,18100.78,1522.42,A,3.80
1003,M,divorced,37.30,1,IT,tertiary,9896.16,24496.82,2723.35,None,4.38
1004,F,divorced,25.02,1,legal,postgrad,10136.44,26690.01,4143.04,B,4.55
1005,F,divorced,48.37,2,government,secondary,2521.11,13439.81,240.26,None,3.09

In [18]:
df_merged.to_csv("results/cust_actual_predicted_adaboost.csv")